MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP128MC206/mcu.h
#define _IC4CON2_SYNCSEL2_POSITION               0x00000002
#define _IC4CON2_SYNCSEL2_MASK                   0x00000004
#define _IC4CON2_SYNCSEL2_LENGTH                 0x00000001

#define _IC4CON2_SYNCSEL3_POSITION               0x00000003
#define _IC4CON2_SYNCSEL3_MASK                   0x00000008
#define _IC4CON2_SYNCSEL3_LENGTH                 0x00000001

#define _IC4CON2_SYNCSEL4_POSITION               0x00000004
#define _IC4CON2_SYNCSEL4_MASK                   0x00000010
#define _IC4CON2_SYNCSEL4_LENGTH                 0x00000001

#define _QEI1CON_CCM_POSITION                    0x00000000
#define _QEI1CON_CCM_MASK                        0x00000003
#define _QEI1CON_CCM_LENGTH                      0x00000002

#define _QEI1CON_GATEN_POSITION                  0x00000002
#define _QEI1CON_GATEN_MASK                      0x00000004
#define _QEI1CON_GATEN_LENGTH                    0x00000001

#define _QEI1CON_CNTPOL_POSITION                 0x00000003
#define _QEI1CON_CNTPOL_MASK                     0x00000008
#define _QEI1CON_CNTPOL_LENGTH                   0x00000001

#define _QEI1CON_INTDIV_POSITION                 0x00000004
#define _QEI1CON_INTDIV_MASK                     0x00000070
#define _QEI1CON_INTDIV_LENGTH                   0x00000003

#define _QEI1CON_IMV_POSITION                    0x00000008
#define _QEI1CON_IMV_MASK                        0x00000300
#define _QEI1CON_IMV_LENGTH                      0x00000002

#define _QEI1CON_PIMOD_POSITION                  0x0000000A
#define _QEI1CON_PIMOD_MASK                      0x00001C00
#define _QEI1CON_PIMOD_LENGTH                    0x00000003

#define _QEI1CON_QEISIDL_POSITION                0x0000000D
#define _QEI1CON_QEISIDL_MASK                    0x00002000
#define _QEI1CON_QEISIDL_LENGTH                  0x00000001

#define _QEI1CON_QEIEN_POSITION                  0x0000000F
#define _QEI1CON_QEIEN_MASK                      0x00008000
#define _QEI1CON_QEIEN_LENGTH                    0x00000001

#define _QEI1IOC_QEA_POSITION                    0x00000000
#define _QEI1IOC_QEA_MASK                        0x00000001
#define _QEI1IOC_QEA_LENGTH                      0x00000001

#define _QEI1IOC_QEB_POSITION                    0x00000001
#define _QEI1IOC_QEB_MASK                        0x00000002
#define _QEI1IOC_QEB_LENGTH                      0x00000001

#define _QEI1IOC_INDEX_POSITION                  0x00000002
#define _QEI1IOC_INDEX_MASK                      0x00000004
#define _QEI1IOC_INDEX_LENGTH                    0x00000001

#define _QEI1IOC_HOME_POSITION                   0x00000003
#define _QEI1IOC_HOME_MASK                       0x00000008
#define _QEI1IOC_HOME_LENGTH                     0x00000001

#define _QEI1IOC_QEAPOL_POSITION                 0x00000004
#define _QEI1IOC_QEAPOL_MASK                     0x00000010
#define _QEI1IOC_QEAPOL_LENGTH                   0x00000001

#define _QEI1IOC_QEBPOL_POSITION                 0x00000005
#define _QEI1IOC_QEBPOL_MASK                     0x00000020
#define _QEI1IOC_QEBPOL_LENGTH                   0x00000001

#define _QEI1IOC_IDXPOL_POSITION                 0x00000006
#define _QEI1IOC_IDXPOL_MASK                     0x00000040
#define _QEI1IOC_IDXPOL_LENGTH                   0x00000001

#define _QEI1IOC_HOMPOL_POSITION                 0x00000007
#define _QEI1IOC_HOMPOL_MASK                     0x00000080
#define _QEI1IOC_HOMPOL_LENGTH                   0x00000001

#define _QEI1IOC_SWPAB_POSITION                  0x00000008
#define _QEI1IOC_SWPAB_MASK                      0x00000100
#define _QEI1IOC_SWPAB_LENGTH                    0x00000001

#define _QEI1IOC_OUTFNC_POSITION                 0x00000009
#define _QEI1IOC_OUTFNC_MASK                     0x00000600
#define _QEI1IOC_OUTFNC_LENGTH                   0x00000002

#define _QEI1IOC_QFDIV_POSITION                  0x0000000B
#define _QEI1IOC_QFDIV_MASK                      0x00003800
#define _QEI1IOC_QFDIV_LENGTH                    0x00000003

#define _QEI1IOC_FLTREN_POSITION                 0x0000000E
#define _QEI1IOC_FLTREN_MASK                     0x00004000
#define _QEI1IOC_FLTREN_LENGTH                   0x00000001

#define _QEI1IOC_QCAPEN_POSITION                 0x0000000F
#define _QEI1IOC_QCAPEN_MASK                     0x00008000
#define _QEI1IOC_QCAPEN_LENGTH                   0x00000001

#define _QEI1STAT_IDXIEN_POSITION                0x00000000
#define _QEI1STAT_IDXIEN_MASK                    0x00000001
#define _QEI1STAT_IDXIEN_LENGTH                  0x00000001

#define _QEI1STAT_IDXIRQ_POSITION                0x00000001
#define _QEI1STAT_IDXIRQ_MASK                    0x00000002
#define _QEI1STAT_IDXIRQ_LENGTH                  0x00000001

#define _QEI1STAT_HOMIEN_POSITION                0x00000002
#define _QEI1STAT_HOMIEN_MASK                    0x00000004
#define _QEI1STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI1STAT_HOMIRQ_POSITION                0x00000003
#define _QEI1STAT_HOMIRQ_MASK                    0x00000008
#define _QEI1STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI1STAT_VELOVIEN_POSITION              0x00000004
#define _QEI1STAT_VELOVIEN_MASK                  0x00000010
#define _QEI1STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI1STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI1STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI1STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCIIEN_POSITION                0x00000006
#define _QEI1STAT_PCIIEN_MASK                    0x00000040
#define _QEI1STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI1STAT_PCIIRQ_POSITION                0x00000007
#define _QEI1STAT_PCIIRQ_MASK                    0x00000080
#define _QEI1STAT_PCIIRQ_LENGTH                  0x00000001

#define _QEI1STAT_POSOVIEN_POSITION              0x00000008
#define _QEI1STAT_POSOVIEN_MASK                  0x00000100
#define _QEI1STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI1STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI1STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI1STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI1STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI1STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI1STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI1STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI1STAT_PCLEQIRQ_LENGTH                0x00000001

